

module.exports = {
    'type': 'FeatureCollection',
    'features': [
        {
            'type': 'Feature',
            'id': 'xin_jiang',
            'properties': {
                'name': '新疆',
                'cp': [
                    84.9023,
                    41.748
                ],
                'childNum': 18
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@@\x9BρȁôƧƦóəʵסʵóƪԫʵѵͩƧͩړ\x9Bυࡓɛʵ@ȃ@óᇑѵƨɝɚôóНѺͩɜ̏ԭʵôƧɞñ@υƩ\x97݇ȂóƩƧ@ѵȂυ\x9CƥŌਗ\x97\u0965ɛóʵѵƧѹ\x98݇̍ࢯ\x98əɞυ\x98ρͩ̏óਙƨƧŋôōó\x9A̍ͩóʵן\x9BóŋړͪƧѶ@ɜԭ\x97ԫƦɛȄ̍\x9BɝȄöςƩȂ̏\x9CñȀ̏\x9CƩóóŎə\x98@Ő̎@ɞȀɝŎôƨóנѵȄƧ@óŏɝ\x9CóɜôŎ̍ͨςŎ@ƨóôƨɞ݈ʶóƨφó̎Ȁƨ̍ԮòѸԮמ@ѺȀ@ƪၬֆòȂñ̐òȂɜ\x98óƨ̒Ŏ̑\u07FC@φρȀ@Ő๐ς̎Ƨφ@ɝφڔ೦Ԯǿࢰ@ƦŏԮƨƨȄƧ۬ɜʶڔŐɚɚóŐôƨ\u07FC\x98ôƧƧó̐ƥóŏѺǿƦȁφƧς\x98ƨƧ̒@ɜƥƦυ̐ɛƪͩƩəƪʷ̑ə@ȃƨʵנŋྸōਚԭԪ\x97@ɝƨŋ̒օςʵôƧ'],
                'encodeOffsets': [[
                        98730,
                        43786
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'xi_zang',
            'properties': {
                'name': '西藏',
                'cp': [
                    88.7695,
                    31.6846
                ],
                'childNum': 7
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ôŌנ\x9Côʶ̎ͪô\x99óŎƨŌਚƧ̐ôςͪφ\x97ɚɝࢰ\x97݈̎Ѻ\x97Ѷƨôʶ०ɜਘ\x98Ʀŋφ\x9BѶȁ̍\x97ôŏɚŋ@̑ə\x97@ŏò̍ɜ\x9BóƥôʷƧ̍φѹԪ̍ע@Ѹʷɜ@ôñנ@Ѷɛɞô̐ŏѶƨѸƧƥōƦ\x9Côŏô\x97@ƧôƩ̒ŋƨŌƦǿô̎ɜȁ̒\x97óʶѶôôО̒\x9BςƥɜНφσɛȁ̎υƨఱƧŏ@ʵƥ\x9C@ŌóóóͩƨƧóŋ̑õóɞóɝԩͪɝρôƧ̍ƧѹͨڑŎ̑ōóƧࢭͩ̏ѵɝóఱóóԪυô@̒ƥŌ̏Ƨ̑Ȅ݇ŎƧ\x9Bѵӏ@ɛõŏɛȄôӒƧŌѵǿɝ\x98Ƨŋԫ@̏ʴƥ@óǿ̑Ȁóǿ̍ςóóυô@ʶɛñρƦƩŐó̎ó\x9Cѵó̑ͪࢯОóɜן\x98Ƨ̏ƥȄ\u07FB̎̏̐ןŎɝɜöɞƩȀôöɛȀóͪ̐ƨƪ̍̎ȂƥԪυО@φɞ\x98ôƪ'],
                'encodeOffsets': [[
                        80911,
                        35146
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'nei_meng_gu',
            'properties': {
                'name': '内蒙古',
                'cp': [
                    117.5977,
                    44.3408
                ],
                'childNum': 12
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ኊȁ\u0ACAö\u07FCƩɜɛנñԮɛѶóԮô@ȁѸóמ̎ගѺၬ@\u07FCʶԮӒ\u07FC̎@ŐѹӒ̒Ԫƨöග̑ѶȄ̒ς\u0964\x9CѶɚöɞɜʴڔôôȂ̎\x97ѺȀς\x97ƨ\x98ƪóԪ\x97ɜôɛОਕڔԭ\x98ѵ̍ѹȂԫ\x9Bɛƥ̍Ȃóɜ̎ô@ʶ݊ੲࢮʵږͪנƨôȂƧ\x98̐ͪ@ŐƦƨφԬѶɜôƦ@ŐƧôôƦəŐ̏\x9B@ŐڒѶԬô̐ʳԩНςōôŏɞ@ƨȂѶəóƧ̒ػ̎ó̐Őנóƨô̒@ƨɚɚ@עԫɛɛ@ȁυͩƥʳòևρ\x97̑ࡗƧͪ\u0F03ॣԮփ̎Ʀ@ôô@ôō@\x9A@ȁѵóƨ̍υȃóʵɛƨƥóυȂóəƪ\x9B̐ρƧͩɜԭڔȄ̎عƧȁ̐ŏó̍ɛ\x9BƥƧ̑óρŐ@Ƨ̏\x98ɝəɛ\x98\u07FBͩ̍ͩɝО̍ƪƧóóӓƨóƧʳ݇@ɝςƪ\x9C@ʴƩ\x97ƧƦôƨɛȄə\x9BƧŋυ\x9Bóͩѵ@ɝǿóŌן̍ɛ\x98óО̍\x9C̑̏ôȁ̍ŏòȁñóƦͩ@ǿə@ɛƧ̑\x98ρȁυô̍օѹ\x9Cóȃə\x99@ȂσʵѷƪòƩ̍\x97ôó\u07FBۯôʳƧ\x99ó\x9Aõʵѵóѹɜ̍ȂѹôɛŌφ\u0588Ʃͨρóυӑóޟఱ̑݇ͪóƪƨŌóȄڔԬƩςםñ̑ȃѵŐԭŏƨȁɛǿρôõɚɛóƧОə@ѹ̐ѵöԪͨôͪɛ̒ןŏƧƥóôƥƧɛŌôóɝó@̒݇Ӓ̒Ō@Ŏԭࢰ'],
                'encodeOffsets': [[
                        99540,
                        43830
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'qing_hai',
            'properties': {
                'name': '青海',
                'cp': [
                    96.2402,
                    35.4199
                ],
                'childNum': 8
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ƨ@ôƪ݈ȁƪ\x98@φɝòóƨԮʶɛ̐ѹͪôОəóƧɞᇒѶ@ôږô@ǿѶ\x9Bƪȁς\x9Cɜͩφ\x98ςŋɞôѶɛƨŌɞ\x97@ɚςŐñԪॢͩƨȂɞóƨŐ̎ŏעӏ̎óƧƦô\x9C̒ȁɜ\x9Bςͩ̒\x9CɚɛƨôƨɝφɛóȁƨŋóóɚͩƨóóƩ@ƧəŋƦƩ̍@ƧƧôǿυ̑@ȁɞǿõŏρƥסɚƧóτԫɞ\x9CôƧƦ@ñȃòñƥóυôôѹѵ\x97@ŏ̏Ȅɝó@ȂəŌóəѹƦ@Ő̍Ōυ݈ԩŐƧóôƧ̑\x9BôʵɞƧ̑ѵôƩɞƧ̑\x9CóНѵóôʵ̑\x98ɛȂó̍ƥȀƧŋ̑Ōóƪ@ƨó\x98óŐƥ\x9BƦŎѷƨѵƧ̏Őɝóѵɜן@óòɛ@ѷʸס@ԩ̎υѺƨ̎óʸôƦɛ\x9Cñ̎@Őɚ\x98@̒əŌóŐ̎\x98'],
                'encodeOffsets': [[
                        91890,
                        36945
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'si_chuan',
            'properties': {
                'name': '四川',
                'cp': [
                    102.9199,
                    30.1904
                ],
                'childNum': 21
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ô\x98ôŋó̑Ԯ̒ɛОמͪƨōöͫ\u07FCƥôȃƨóóñôƧóƧôōڔŏƨŐ@Ŏô\x98òƥѺŎ@ōɜóנ\x98ôǿô\x9BƦôԮ̍ɜôɚ\x9BƧ\x97ñɛɚȁ̍Ƨɛևυ@óóôŋρԭɝ@Ƨʸ̍ŏυɜƧƧóƧƨȁρ̍ƨȃɚ\x97ôʵφóô̑̏Ȃ̑ʵɜʵɞ@ƨʳסƩóŎə\x97óɜƧôƩƧρ\x98óôôô@ŎƧƨƨƪѹ\x98ó̍̍Ʃ@̏ѹНôޟ̍Ʃóƪυɝɛ\x97əƨôŎɛȀ@Ȃ@ñɝʶ@Ōρנ̏\x97õóɛͨƨȂѵОɛʵ@̏ƩŐó\u07FCƧల̍φɜȂυτɛОρƦɝƨóƪ̒Ѷɝƨóʶ̒\x9CóƨƨôԪŏφ݇̎ŋ@ŏѺƥôɚɚŋ@ȁɞô̐ȃ@ŐѶ\x98óѺφóƦôñòòȄ'],
                'encodeOffsets': [[
                        104220,
                        34336
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'hei_long_jiang',
            'properties': {
                'name': '黑龙江',
                'cp': [
                    128.1445,
                    48.5156
                ],
                'childNum': 13
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ᇔȂਚНƨŐѶŏöƥςŏñƧƦóƨȁ@óƨ\x97óȁφӑóóƨ\x98óǿ̎̑ôНɞ\x97ó̑ɜə\u07FC\x9B̎ǿ̒ôڒӑφ@Ƨȁ̎̏ƥƩ̎ρశ\x98ôȂςƨφ@נɞ݈\x98̑ƥƧɛƨʵƧȃƥ@Ƨƥ@ŏ̑ԩôɝρρóɛƧ\x9BƩͩƧó\u07FBʸ̍ʷѹƥɞڕõ̍öɝυ\x97̍ȂƧ̐̑ŏóƨñŋѹóóȁ̍\x9B̏Ԭõʸ̏ŏ@ǿ̍@ƧОυ@ñƨòȀƥŎ̑ŐѵóɛŌóȂԫōƧŎѹñ̍ʶóОן@Ƨ̎Ѷô@Ȃ@\x99óŎó@@ó̍ƥԭք\u0F04\u0964ƨͩ̒ࡘς\x98ñ\u0588Ʀʴφͪ@ȂɜɜסԬə@Ƨə̑@Ƨóןô̏ŏ̍ô̑ؼôƨѵɚƧȁɝ@óŐρŎԪО̏ʴ'],
                'encodeOffsets': [[
                        124380,
                        54630
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'gan_su',
            'properties': {
                'name': '甘肃',
                'cp': [
                    95.7129,
                    40.166
                ],
                'childNum': 14
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ڔôԮࢯ@ō̑ŋ݈ӑ@̑ɞôóôɜŋƦƨôóƨƦנŐɜ̑óͩԩͧѶõѺ̏ɚ@ƨНɜôöəςóɜȀƧȂԮŐѶŏ̒ȄמòƪρړԫôȃƧŋôƩ݈ͩɚ@@ǿɜ@φͩóŏɜӑƧōôǿ̎\x9Bôƥƪóõ\x9Bö@ô\x97ƨ\x98ôƧƦôó̒ɜ@ɞŌõʶ̏Ő@ȀóôƨȂ@ʶע@@ƥ\u0B7Eӑó̑óŋôʵóɛړ@@ƩöóƩóρ\x97ɛƨ̑@óʷƥƥ̎ɛƧ\x9BôōƧǿôͩѵôɝȃɞȁõƧρóó\x97@ōƧŏړŐóŎôƨóƨôòƧôóȄ\u07FBƦõͬƧŎםͩɜНԭ̑ô̒óŌó\x97ƥ@óƨɝ\x9BσԬƨôעəςƦöŐɝȀ@Ȃφ̒óȀƨƨ̎@ƥƪɚŌ@ƨôƪƧôəͪôôƧŌôȂυɜƧɞƧóəɜ̑\x9Bρͪɛ\x9C̑Ȃó\x9Bƨƥ̍ôסӐ̍ŐƧŏɝôƧȁॡͪòԩρŏ@əɝ\x98ƧŋѵɜɝóρŌυ\x97ɛͪρ\x9BƩȂѵ\x9C@Ȁڕó@Ȅɜʶφࡔڔ\x9CƨͪѶͪԬʶôƩעʶɚʶƥôóƨςȂ'],
                'encodeOffsets': [[
                        98730,
                        43740
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'yun_nan',
            'properties': {
                'name': '云南',
                'cp': [
                    101.8652,
                    25.1807
                ],
                'childNum': 16
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ôɞôɝ̒öôŌƧƨôͪôô@ŋƦ\x9B@ʶƨŐô\u07FBƪŏ@̐ɜʶѶНƧȁɜͧöô̐\x98ςן@ŋɞʵ@ò@ȁɜǿóōɚƧɜ\x98φɞôƩ̎ƪóޠѺО@̐̎ƪô̎Ѻ\x97ƧƩƨƧ@ōóóôóς\x97ƪƨƨóôɛó̑ԭ\x97ƥŌɛǿɝƨɛͩô\x9B@ǿƨȁѺŌɚɛ̍ןѶНɛƧôóƥȁƦͩôŎɞ\x97ƨ̑ɜ\x97òôφ@ƨʵ@ɛѹōóȃəƨυǿóʵρƧƧŌƩɛ̏ȄñƧƧȀɝ̍ԩʶƧ̑υ\x97óŌƥʳɚӑóНƥô̑\x9BóӒѵʵѹ\x9CƧӐןôƪφõŌƪ̒ԫŌƧؼƨƨס\x9BρȁƧ\x9CƨȂóʶó@@ʴƨôôφ̎Ŏ@Ȁƨ\x97ƪɚƨ\x9CóƨôôôςóޤƧŌƩŋƧԪ'],
                'encodeOffsets': [[
                        100530,
                        28800
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'guang_xi',
            'properties': {
                'name': '广西',
                'cp': [
                    108.2813,
                    23.6426
                ],
                'childNum': 14
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ƦŋѺ̎ڔʵƨŐ@ƦמȄƪôóȂɜŌɚͩɜ@öóɜôôȂƦôɜȁ@ɞφ\x9BóȄ̎\x9Bƨʶɞŋƨʴɚǿ̐̎Ԭ@ôñ@̏ƨ\x9Bρ۫ô\x9BɚƨƨНƪŐ̎\x9BƥóƦʵƥŋ@ȃóƥƧ@@ŏɝǿôυƧȁѵɛ@əóŏ̑@@ə̍\x9BóƧó\x97@ȁƩ\x98ρóòНƥô@Ӓ̑@óŎ̍ƥσŎυ@̍ƨ@Ō̑ôóͪƨ̒óŌړ\x9C̏Ŏ@ŌôȄѺŎ@ɜƧʶυ@ñóɛ\x98Ƨ̒ɝ\x98óōƥͪ'],
                'encodeOffsets': [[
                        107011,
                        25335
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'hu_nan',
            'properties': {
                'name': '湖南',
                'cp': [
                    111.5332,
                    27.3779
                ],
                'childNum': 14
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@@քɜОƨ@öŐמóƪôƩɚ̒Ő\u07FCȁςͩɜòƪ\x97ɜȀò\x97ñɝò\x97Ѻͪ@ŏƨŋóɝôǿƨ\x99ɚȃóəƨȃѵͩó̍@ȃƨóóƥƨƧ@ʵƦ\x9Bóͩɜ\x97ɛóñԭɛōυȂ̍ƧƦō@ɛƥ\x97ɛȀ̑\x9Cóʷóō̍\x9CƩŏƧОəƧó\x9Cς۬Ƨ\x9C@̐óòԫ@̏̍əȀƧʳɝŌóɞƧ\x98ƨɜóŐƨò@ȄƧŌρŋóôԪОóʶ@̎óȄ'],
                'encodeOffsets': [[
                        111870,
                        29161
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'shan_xi_1',
            'properties': {
                'name': '陕西',
                'cp': [
                    109.5996,
                    35.6396
                ],
                'childNum': 10
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ςôöƨɝȂɞȄѶóóͪƨȀóŎƨ\x9C̍ɜƦƦôʸ̒@ɜƧς\x98ƪôõô@ƪڔ@ôɜóʶôŌô̒\u0B7DӒ@Ʀ@Ѻ̎ɜѺɛѶôöʶô\x99ƨ\x9Aóʴ\u07FC۰óô̎\x98ñƪѸƩτʶ@ȁòŋəѹóǿ̑ʵ@ȁ̒ʷυփô݉ôН̏ط@ȁƨóô̏ƪõ@ʳ̐ʵ@ɝɛŋƩŌɛóןôƧŋ̒ó@ŏ̐ƥ@ŏυ@ƧƧôן̏@ƥȂѹɜə\x9Cɛóԭ̎ƥóó\x9CóȀן\x97ɛô@ŎѹōñƦ'],
                'encodeOffsets': [[
                        108001,
                        33705
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'guang_dong',
            'properties': {
                'name': '广东',
                'cp': [
                    113.4668,
                    22.8076
                ],
                'childNum': 21
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': [
                    '@@@Ȃô\x98ôƨ̎\x9C@ɚ̒@ôŐ@ɚѶɜƨȂóφɞȀ@Őƨ@ôƦ@ȄƦŌƥʶƦôôŎôʸ̒\x9BɜǿƦ\x98@ɜƥŎ̎ƨφȁɜŎòƥԮŎƨōóŏɛƧɝəɞƧ\u07FCɜςȃñȄƦŎ̒ōôòƨəƨ\x98ɚН@əƨ̏ƪʵυŌəɛóəԭŏə\x9Cóŏѹ\x9CρʵɝƦ̏\x99ƥʳѶ\x9Böō̑óóŋρȀυƧƥɛѹōƧôן\x97ɛŏѵ@óŋôʵɝ\x9Bƪԩõ@Ƨō̍@Ƨ@@ƦɝԮƪО@@',
                    '@@X\x8D\xAFaWĀ\x84@l\x8F'
                ],
                'encodeOffsets': [
                    [
                        112411,
                        21916
                    ],
                    [
                        116325,
                        22697
                    ]
                ]
            }
        },
        {
            'type': 'Feature',
            'id': 'ji_lin',
            'properties': {
                'name': '吉林',
                'cp': [
                    126.4746,
                    43.5938
                ],
                'childNum': 9
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@נ@ôН̎ʵѺòƨōԬŎôȁɜŋѶô̒ŏƦōñǿòƧφ@ƨН̎@@Ȁ̐Őöʷ̐ԫ̎\x9CôȂѺôòŌôƧ̒Őƨ̏̎ȁφ\x98@ŋƩͩםȃƨ\x97@ȁ̑ʶ@Ōóôɛ\x9Cƥѹ̑\x97συ݇@ɜρƧȃࢯƨô\x9CəȂɛōƩɛ̏υρóõ\x9Cƪʴυφ@ʶôŌó\x9Cρք@ɜƧ@ɝǿƧͪρȀƩó̏ŐƨȂ̍غړȃɛԮƨͪ̏ςƩ\x9CôɚφȁƦôɜƧôʶφȄ'],
                'encodeOffsets': [[
                        126181,
                        47341
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'he_bei',
            'properties': {
                'name': '河北',
                'cp': [
                    115.4004,
                    37.9688
                ],
                'childNum': 11
            },
            'geometry': {
                'type': 'MultiPolygon',
                'coordinates': [
                    ['@@Ʃ̒̏ŌѺ̒Ʃ\x98óȄƧŌƥͪòôñȂ̎ŐóȂ̒̐̎\x9BôНɜ\x97נ̎ôŋɞȀѶ@ôͪφ\x9CƨŌɚ\x9CɜȃóƧƨƥƪ\x98@ʳƩ\x9Bɞρ݈@υНφʵɜ\x98ƦρƨƧ̍ɝóɛѹ̍ρŏ̑ôóƨ@\x9CƧƦôƨɛ@ƥƨ@ȂƦ@@ôəŐƧʶƨŌυ\x9C̍̎ɛŋôōɝ@óƧ̍\x9BƦʵѵʳôʵɜŏςôƪŋƨŌɚ@ôНƥƧ@ōѸɛ̐ô̎ʵѵНԭ@̍̍Ƨò@ȁɝ@əρυͩƪ̏ƩõƧŎƧōó\x9AॡȄɛʶɜȀ@ɞςѶƧ\x9CƥςɛŐ@ɚɜɜ@Ŏôôς\x9Cƪς'],
                    ['@@õə@Ƨɛ\x98@ŐóƦφô']
                ],
                'encodeOffsets': [
                    [[
                            117271,
                            40455
                        ]],
                    [[
                            120061,
                            41040
                        ]]
                ]
            }
        },
        {
            'type': 'Feature',
            'id': 'hu_bei',
            'properties': {
                'name': '湖北',
                'cp': [
                    112.2363,
                    31.1572
                ],
                'childNum': 17
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ñȄυƦöŐƩ\x98óנƨƨφ@@Ő̏Ʀ@Ő̑ôƨŌנóɜôƪŋɜŌѶօڔə݈òɞōɜŎôӏƦóƨô̒óôȃƨó̎ŐôƧƪ@ƨȁςƧə̑̎Н@̍Ƨŏρôԭͩԫ\x97̍ʵƧ\x9AóȀôɞƧŌ@Őѹͩñ\x98òɞñ\x98ɛǿƩ\x98ɛñρͪ\u07FBȂ̑ŏƪəƩóםôõŏƧ@ɛНƥȄó\x9B̑ѺƧ\x9BôφóƨƨƦƪóɜŐôóòôƨóφ̐ƨóƦ̎'],
                'encodeOffsets': [[
                        112860,
                        31905
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'gui_zhou',
            'properties': {
                'name': '贵州',
                'cp': [
                    106.6113,
                    26.9385
                ],
                'childNum': 9
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ɜȀƦŋԮ\x98ô̒ɚ\x98ôōעƪƧʴɝ@ɛʶ̒ʶ̐ȁƦ\x9CóȂô@ôŏ@ōô\x97ƨʶѸô@ʶƨ\x98ɞó@ōτöòυƨ@@əƨô@ɛ̒@Ʀɜôȃ@̍ôʵԩНôóςŌƨŋ@ȃƧñôŏƧɛƨ\x97ôɝƧʵ̍\x9Côȃυ\x9C@ɝɛȂƥóóȁɛóõôɛ@əͪɛŋôȁƩóםȃ@ƥƧŏړʶѹ̍ƥŌƦȂóôɜƨѵО̎נəɜѹŋƧȂ@Ȁó\x9CɜͪɞƧ'],
                'encodeOffsets': [[
                        106651,
                        27901
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'shan_dong',
            'properties': {
                'name': '山东',
                'cp': [
                    118.7402,
                    36.4307
                ],
                'childNum': 17
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@Ʃ̐φͪɚςɞ@@Ȃƨñ̎̎Ԯ@ѶОƨƧڔ@φН̑ŋ@Ʃ̒ǿ̎@ƨɜԬςôʶ̐ʶöԫƨƧנƥɜŎôō̎@ôŏóρƧŏԫôóƧԩó@ƥɜƧԭóƨʵɛƨ\u07FBӑɜНԩ\x98óô̑óƧʳə\x99óɛƧ@õȀƧ\x9C̍ȃɛŐóŏυО̍\x97óɝƩ\x97ԩ@ƧɚԫȄɚʶƨ\x98ɞʶԪ̐ړɛƪ̒'],
                'encodeOffsets': [[
                        118261,
                        37036
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'jiang_xi',
            'properties': {
                'name': '江西',
                'cp': [
                    116.0156,
                    27.29
                ],
                'childNum': 11
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ƧȄôɚəȄ̎ʶԬ\x98ԮͪςóƨŐƪ\x9BτɞƦōƥƧ@ŏςôóŐôô̒ʷѶ\x97ƪƩƩǿ@ō̒ɛôυ@\x97Ƨȁѹɛəƨѹ̑ƨ̏óƥѵʷô̍ɛȁôŏɝǿƧԫƧ\x9BôʳƥōòȃρȄ\u07FBɛɝƨɞɚɜƨôŐƧŎԭōñƦòԮɜôɛ\x98ôͪƥ\x9C@ʶƧƨôƦƧô@Ȅô̎Ѷͪ'],
                'encodeOffsets': [[
                        117000,
                        29025
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'he_nan',
            'properties': {
                'name': '河南',
                'cp': [
                    113.4668,
                    33.8818
                ],
                'childNum': 17
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@φ\x98̎ƪ̐\x98ɞȄɚ@@Ȃעó̎ŌѺ̒ôֆॢȃô\x99ƨŎƨōƪöƩ̑ڔɜԩ̏ɝʵƧ\x97əʵԬȃƨəԪ@@Ƨ̒ŏô̍υȁƧɚ̍ôóŋ@ɝƧŋõ̑σ\x97@ŏɜŋôɝ̒ƧɚôôطρóóɛƩ@óƨ̍ŏƧôóȄ̑ôƧóƥôóӐɛōɝŎ݇ñړɚѵֆ@ɞ̏ʶ@ʴƩöó̐'],
                'encodeOffsets': [[
                        113040,
                        35416
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'liao_ning',
            'properties': {
                'name': '辽宁',
                'cp': [
                    122.3438,
                    41.0889
                ],
                'childNum': 14
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ƨʴƧôôӔƨô̎ƩɞН̎ͪ\u07FCͪɜ\x97ɞɚ̐\x97@ƨςŏ̒ôƦƨɜ\x9Cô̎ƪôςǿƨͩɞȀƨ@@ɛςփô\x9Bóŋ@ʵφυƩʳö\x9B\u0965փρѹס@əɛ@ͩࢯ@ѹʵρ\x97ƩʶφȀƧ݈̒۬óʸɝŎѵ@ԭԫןɛƧƨƥςɛ\x97υʶφО'],
                'encodeOffsets': [[
                        122131,
                        42301
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'shan_xi_2',
            'properties': {
                'name': '山西',
                'cp': [
                    112.4121,
                    37.6611
                ],
                'childNum': 11
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ɚѺñŌɚ\x9AôȄѺ\x9B̎ֆφóςȂ̒\x97ɜƨɚ@@Ȁƨŋôȃƪ\x97ѹ̑̐ŋƪ̑Ʃρρ\x9Bóó@ōɛɛ@əɜŏƦρƨ\x9Bρѵ@ɝɛǿɜʵóօѹ̑̍ŋסô@ȁə@ɝȃ̏\x97̍Ʃυ\x97Ƨô@Ȃ̐ظóОó݊φք̑ʸ@Ȃ̒ʶôȀ'],
                'encodeOffsets': [[
                        113581,
                        39645
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'an_hui',
            'properties': {
                'name': '安徽',
                'cp': [
                    117.2461,
                    32.0361
                ],
                'childNum': 17
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ó̎̑Ő@ƨƪ\x98Ѷǿɜ̑φ\x97Ʀʵ̐\x98Ƨѵôóƪôôυς\x97ƨȂɞŏ@̍ԫôò̑ƥ\x97óȃѶͩƧƥôŏѺ\x9CôŏƦ\x97@\x9BƥͩƧ\x97ôȁυó@̑ƧɛѵʵƩƪѵ\x98̑ʸóóôŏρó@ŐƦƨƥŎσɝƩ\x9C@̎̍Оɚ̒ρƨƧȂôɜςôóظəó̑ƨóɞɛŌ@Őτ\x98ö̒ƨŌ@ɞôŌ̎óƨəφȂ'],
                'encodeOffsets': [[
                        119431,
                        34741
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'fu_jian',
            'properties': {
                'name': '福建',
                'cp': [
                    118.3008,
                    25.9277
                ],
                'childNum': 9
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@̎\x9Bóȁƨӑ̒\x97̎ɚƨͩφŐƨɝ̎ŋóŏρ\x97@ōƨ\x9Bòʳəóƨō̏\x98õɛƧ@ƨѵƧōəŏóŋƧô̑ɝɛʳƥ@@óɛõ@Ƨ̑ƧóȁəƧ̑\x97Ƨ̐@ɚəОƧ\x97Ƨɚóñ̑Ŏóʴƨ\x9CƨԬɞȀóŐɜȂó̎ѶʸôƦƧ̐Ѻ̒ɚƧѺɜƨȂ'],
                'encodeOffsets': [[
                        121321,
                        28981
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'zhe_jiang',
            'properties': {
                'name': '浙江',
                'cp': [
                    120.498,
                    29.0918
                ],
                'childNum': 11
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@Ѷʶƨɜ@̒φôóȂƨ\x98Ʀͪ@\x9C̐\x98Ѹ̍τȂ̒̑נŐמôƪƧôӑ̑\x9B@ƥρͩƨօ̏@@υɝó@ŋɛ@ôƩəóƧѵυó@ƩɜŋƧ@̍ŌƧɞυŏƧͪ̍ə̑\x98ƧӒôȂ̍\x9C@\x98óφ̑ɜ@ŎƪȀ'],
                'encodeOffsets': [[
                        121051,
                        30105
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'jiang_su',
            'properties': {
                'name': '江苏',
                'cp': [
                    120.0586,
                    32.915
                ],
                'childNum': 13
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ôɞ̎\x98φНôŐɜŏ̎Ȅƨ\x9Böǿƨ@ôɜɚ\x9Aƨʴ̒ôôó@Ƨ̎əԮȃԪૉöͩ̐ƧòʵφƧôʵ@óړɜóŏɜǿƧ\x9Bɝρσȁѷ̎̏\x97ƥ\x98óŐѹ\x9BóŐƨƦѵͪôȄƦ\x98ñ̒Ԭó@̎ɝŐƧȁρ\x98óφƩóóôƨѶ̏\x97ƥʶυ\x98ɛ̒ѵȀ'],
                'encodeOffsets': [[
                        119161,
                        35460
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'chong_qing',
            'properties': {
                'name': '重庆',
                'cp': [
                    107.7539,
                    30.1904
                ],
                'childNum': 40
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@əȂòɜƨ\x98ѺɛƦȁ̐@ƪ\x97õŏφƥòȃƥ̍Ƨôυ̏ƧôñóóôɛŏƩôƧƥôƧóυƨ\x9C̒ѹô\x9CƦȃ@փƥɛ̑@@ɜƧó@ɚƧ@ñφσõ@ŎɝôƧ\x97@ʵѷóƧʵó\x98@ŎóŐó@ôȁƥ\x9Bó̒υôóʶə\x98ƧȄς̎ƧȂôƨƨƨφɛ̎Őƨʷɞ@ςԮóŌôôφ@ɜ\u0588̎ƨ'],
                'encodeOffsets': [[
                        111150,
                        32446
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'ning_xia',
            'properties': {
                'name': '宁夏',
                'cp': [
                    105.9961,
                    37.3096
                ],
                'childNum': 5
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ల̒ôޠφӒςôƪͧυևɜŋѺó̎ȁ̍ɛ@ѹס@@ʵƧȁôó@ǿ̐ŏöʵɝŋɛ@ô̑ƥóóƨƧ\x97ó\x98ô\x9Có@ƩôóƦ̍\x9CóȀƨŎɛӒôŐυͪɛ@@Ȁə@'],
                'encodeOffsets': [[
                        106831,
                        38340
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'hai_nan',
            'properties': {
                'name': '海南',
                'cp': [
                    109.9512,
                    19.2041
                ],
                'childNum': 18
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@φɜƦʶ̐ôφô̎@ƨŎö@τʵƦ\x98ԩ۫õН̏óƥȃƧ@Ʃəםƨ̑Ʀ@ޤ'],
                'encodeOffsets': [[
                        111240,
                        19846
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'tai_wan',
            'properties': {
                'name': '台湾',
                'cp': [
                    121.0254,
                    23.5986
                ],
                'childNum': 1
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ô\x97ƩɝöƧɝѵəޣ̏ρƩԭóōóͪρɞƧОôԪ݈ଦѶɜ̒ɛ'],
                'encodeOffsets': [[
                        124831,
                        25650
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'bei_jing',
            'properties': {
                'name': '北京',
                'cp': [
                    116.4551,
                    40.2539
                ],
                'childNum': 19
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@óóó\x9Bυóôƥ@ŏóóə@ƧŋƩŌρóɛŐóʶѶʴƥʶ̎\x9Côƨɞ@óŎɜŌ̎̍φ\x9BƧŋƨʵ'],
                'encodeOffsets': [[
                        120241,
                        41176
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'tian_jin',
            'properties': {
                'name': '天津',
                'cp': [
                    117.4219,
                    39.4189
                ],
                'childNum': 18
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ôôɜ\x97@ƨöɚô\x9Côôɚŏ@óƥ@@ȁƦƧɜ@óƧƨƥ@\x9BƧóəН̏óѷɜ@ŎƦƨóО'],
                'encodeOffsets': [[
                        119610,
                        40545
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'shang_hai',
            'properties': {
                'name': '上海',
                'cp': [
                    121.4648,
                    31.2891
                ],
                'childNum': 19
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@ɞςƨ\x9CɛȀôŐڔɛóυô̍ןŏ̑̒'],
                'encodeOffsets': [[
                        123840,
                        31771
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'xiang_gang',
            'properties': {
                'name': '香港',
                'cp': [
                    114.2578,
                    22.3242
                ],
                'childNum': 1
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@óɛƩ@ρ@ó\x9CôȀɚŎƨ@ö@@ōƨ@'],
                'encodeOffsets': [[
                        117361,
                        22950
                    ]]
            }
        },
        {
            'type': 'Feature',
            'id': 'ao_men',
            'properties': {
                'name': '澳门',
                'cp': [
                    113.5547,
                    22.1484
                ],
                'childNum': 1
            },
            'geometry': {
                'type': 'Polygon',
                'coordinates': ['@@X\x8D\xAFaWĀ\x84@l\x8F'],
                'encodeOffsets': [[
                        116325,
                        22697
                    ]]
            }
        }
    ],
    'UTF8Encoding': true
} || module.exports;;